## [ 접근자 Accessor ]  
- Series/Data의 데이터가 날짜시간(datetime), 문자열(object), 범주형(category)등의 경우 데이터타입과 관련된 전용의 함수들을 사용할 수 있도록 해주는 속성
- Series.str. 문자열 처리 관련 함수명()
- Series.dt. 날짜,시간 처리 관련 속성명

(1) 모듈 로딩 <hr>

In [87]:
import pandas as pd

(2) 데이터 준비 <hr>

In [88]:
datas={'name':["명 노아","박 희진","이 윤서","전 진우"], 
       'age':[ 24,23,22,25],
       'reg_date':["1999/10/10", "2000/7/18", "2001/5/8", "1998/11/11"]}


datas2=[["명 노아","박 희진","이 윤서","전 진우"], 
       [ 24,23,22,25],
       ["1999/10/10", "2000/7/18", "2001/5/8", "1998/11/11"]]

(3) 데이터 저장 <hr>

In [89]:
# Dict => DataFrame
df=pd.DataFrame(datas)
df

   name  age    reg_date
0  명 노아   24  1999/10/10
1  박 희진   23   2000/7/18
2  이 윤서   22    2001/5/8
3  전 진우   25  1998/11/11

In [90]:
#list => DataFrame
df1=pd.DataFrame(datas2)
df1

            0          1         2           3
0        명 노아       박 희진      이 윤서        전 진우
1          24         23        22          25
2  1999/10/10  2000/7/18  2001/5/8  1998/11/11

(4) 데이터 정보 확인 <hr>

In [91]:
# 데이터의 전체 기본 정보 => info()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      object
 1   1       3 non-null      object
 2   2       3 non-null      object
 3   3       3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

(5) 데이터 전처리 <hr>

- (5-1) 행 <=> 열 치환

In [92]:
df1=df1.transpose()

In [93]:
df1

      0   1           2
0  명 노아  24  1999/10/10
1  박 희진  23   2000/7/18
2  이 윤서  22    2001/5/8
3  전 진우  25  1998/11/11

In [94]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      object
 1   1       4 non-null      object
 2   2       4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

- (5-2)

In [95]:
df1.head(3)

      0   1           2
0  명 노아  24  1999/10/10
1  박 희진  23   2000/7/18
2  이 윤서  22    2001/5/8

In [96]:
#1번 컬럼 : object => 정수
df1[1]=df1[1].astype('uint8')

In [97]:
df1.dtypes

0    object
1     uint8
2    object
dtype: object

In [98]:
# 2번 컬럼 : object => datetime64[ns]
df1[2]=df1[2].astype('datetime64[ns]')

In [99]:
df1.dtypes

0            object
1             uint8
2    datetime64[ns]
dtype: object

- (5-3) 0번 컬럼의 이름을 성과 이름으로 분리

In [100]:
# 0번 컬럼만 추출 => Series
nameSR=df1[0]
nameSR

0    명 노아
1    박 희진
2    이 윤서
3    전 진우
Name: 0, dtype: object

In [101]:
# "박희진" 데이터를 추출 => 성과 이름으로 분리
#type(nameSR[1]), nameSR[1].upper()

In [102]:
#for idx in range(nameSR.shape[0]):
#    print(nameSR[idx])
#    nameSR[idx]=nameSR[idx].split()

In [105]:
namesDF=nameSR.str.split(expand=True)

In [106]:
df1,namesDF

(      0   1          2
 0  명 노아  24 1999-10-10
 1  박 희진  23 2000-07-18
 2  이 윤서  22 2001-05-08
 3  전 진우  25 1998-11-11,
    0   1
 0  명  노아
 1  박  희진
 2  이  윤서
 3  전  진우)

- (5-4) 두 개의 DataFrame을 컬럼방향으로 연결

In [114]:
pd.concat([df1, namesDF],axis=1,ignore_index=True) #z컬럼 무시하고 새로 줌

      0   1          2  3   4
0  명 노아  24 1999-10-10  명  노아
1  박 희진  23 2000-07-18  박  희진
2  이 윤서  22 2001-05-08  이  윤서
3  전 진우  25 1998-11-11  전  진우

- (5-5) 2번 컬럼에서 년, 월, 일을 분리

In [116]:
df1[2]

0   1999-10-10
1   2000-07-18
2   2001-05-08
3   1998-11-11
Name: 2, dtype: datetime64[ns]

In [121]:
yearSR=df1[2].dt.year

In [122]:
monthSR=df1[2].dt.month

In [123]:
daySR=df1[2].dt.day

In [124]:
pd.concat([df1,yearSR],axis=1,ignore_index=True)

      0   1          2     3
0  명 노아  24 1999-10-10  1999
1  박 희진  23 2000-07-18  2000
2  이 윤서  22 2001-05-08  2001
3  전 진우  25 1998-11-11  1998

In [126]:
pd.concat([df1,yearSR,monthSR,daySR],axis=1,ignore_index=True)

      0   1          2     3   4   5
0  명 노아  24 1999-10-10  1999  10  10
1  박 희진  23 2000-07-18  2000   7  18
2  이 윤서  22 2001-05-08  2001   5   8
3  전 진우  25 1998-11-11  1998  11  11

- (5-6) 현재 DataFrame을 파일로 저장하기 => pandas.to_XXX("파일경로 = 파일명")

In [127]:
# CSV==> 데이터와 데이터의 구분자
filename="./backup.csv" # "backup.csv"

In [137]:
df1.to_csv(filename, sep=" ",header=False,index=False) # 저장

In [139]:
pd.read_csv(filename, header=None, sep=" ") # 읽기

      0   1           2
0  명 노아  24  1999-10-10
1  박 희진  23  2000-07-18
2  이 윤서  22  2001-05-08
3  전 진우  25  1998-11-11